## 판다스 데이터프레임

In [2]:
import warnings
warnings.filterwarnings(action='ignore') 

import pandas as pd
import numpy as np
import csv
import folium
import matplotlib.pyplot as plt
plt.rc('font',family='D2CodingLigature Nerd Font')

In [5]:
## 1. 데이터프레임 생성-1
df1 = pd.DataFrame({'name': ['Jessica', 'Liam', 'Sophia', 'Ryan', 'Alex'],
                   'test': [45, 30, 40, 37, 48],
                   'assign1': [20, 17, 22, 18, 24],
                   'assign2': [19, 14, 18, 15, 25]})
df2 = pd.DataFrame({'name': ['sica', 'Liam', 'Sophia', 'Ryan', 'Alex'],
                   'test': [45, 30, 40, 37, 48],
                   'assign1': [20, 17, 22, 18, 24],
                   'assign2': [19, 14, 18, 15, 25]})

In [7]:
df1

      name  test  assign1  assign2
0  Jessica    45       20       19
1     Liam    30       17       14
2   Sophia    40       22       18
3     Ryan    37       18       15
4     Alex    48       24       25

In [8]:
print(df1)

      name  test  assign1  assign2
0  Jessica    45       20       19
1     Liam    30       17       14
2   Sophia    40       22       18
3     Ryan    37       18       15
4     Alex    48       24       25

In [9]:
display(df1)

      name  test  assign1  assign2
0  Jessica    45       20       19
1     Liam    30       17       14
2   Sophia    40       22       18
3     Ryan    37       18       15
4     Alex    48       24       25

In [11]:
## 2. 데이터프레임 생성-2

df = pd.DataFrame([['Jessica',45,20,19],
                   ['Liam',30,17,14],
                   ['Sophia',40,22,18],
                   ['Ryan',37,18,15],
                   ['Alex',48,24,25]],
                   columns=['name','test','assign1','assign2'])

df

      name  test  assign1  assign2
0  Jessica    45       20       19
1     Liam    30       17       14
2   Sophia    40       22       18
3     Ryan    37       18       15
4     Alex    48       24       25

In [12]:
## 3. 데이터프레임 생성-3

df = pd.DataFrame()
df['name'] = ['Jessica', 'Liam', 'Sophia', 'Ryan', 'Alex']
df['test'] = [45, 30, 40, 37, 48]
df['assign1'] = [20, 17, 22, 18, 24]
df['assign2'] = [19, 14, 18, 15, 25]

df

      name  test  assign1  assign2
0  Jessica    45       20       19
1     Liam    30       17       14
2   Sophia    40       22       18
3     Ryan    37       18       15
4     Alex    48       24       25

In [13]:
df['name']

0    Jessica
1       Liam
2     Sophia
3       Ryan
4       Alex
Name: name, dtype: object

In [14]:
df[['name']]

      name
0  Jessica
1     Liam
2   Sophia
3     Ryan
4     Alex

In [15]:
df[['name','assign1', 'test']]

      name  assign1  test
0  Jessica       20    45
1     Liam       17    30
2   Sophia       22    40
3     Ryan       18    37
4     Alex       24    48

In [16]:
df

      name  test  assign1  assign2
0  Jessica    45       20       19
1     Liam    30       17       14
2   Sophia    40       22       18
3     Ryan    37       18       15
4     Alex    48       24       25

In [17]:
df['total'] = df['test']+df['assign1']+df['assign2']
df

      name  test  assign1  assign2  total
0  Jessica    45       20       19     84
1     Liam    30       17       14     61
2   Sophia    40       22       18     80
3     Ryan    37       18       15     70
4     Alex    48       24       25     97

In [18]:
df[df['total']>=80]

      name  test  assign1  assign2  total
0  Jessica    45       20       19     84
2   Sophia    40       22       18     80
4     Alex    48       24       25     97

In [ ]:
df[df['total']>=80][['name','total']]   # 주로 사용

      name  total
0  Jessica     84
2   Sophia     80
4     Alex     97

In [ ]:
df[['name','total']][df['total']>=80]   # 사용하지 말자

      name  total
0  Jessica     84
2   Sophia     80
4     Alex     97